{
	"Introduction":
		[
			[
				"The Rubik's Cube is very misunderstood. Most people say things like, \"I just peel the stickers off,\" \"I can solve 5 sides,\" and \"Wow, you must be really smart if you can solve the Rubix (incorrect spelling) Cube!\" These Rubik's Cube) say to sound smart.\n\nYou're probably wondering why this matters. It doesn't. Just don't go around doing these things if you don't know what you're talking about.\n\nAnyway, what is the Rubik's Cube? It's a simple puzzle and configured in many different ways. When it is put into a \"scrambled\" state, it can be extremely difficult, nearly impossible, to solve without any guidance. Luckily, many methods have been created to make this process easier, and now pretty much anyone can solve it, including you!\n\nI'll be going over a method for beginners that is easy to understand, so if you're scared or think you're not capable or \"not smart enough\", don't worry! I even taught my dog how to do it*!\n\nIf you're excited to solve your first Rubik's Cube, that's great! But before we get into how to solve it, you'll have to know a few important things.",
				[
					"*I don't have a dog, nor did I teach him how to solve the Rubik's Cube", 
					[
						null, 670, 16, null
					]
				]
			],
			[
				"First, the Rubik's Cube is solved in layers, not sides. Surprisingly, trying to solve the cube by getting one side at a time makes it much more difficult. This is what a solved side versus a solved layer looks like:",
				[
					"Side",
					[
						"halfWidth -200", 220, 36, "centerAlign" 
					]
				],
				[
					"solved_side.png",
					[
						"halfWidth -200", 320, 180, 180, null
					]
				],
				[
					"Layer",
					[
						"halfWidth +200", 220, 36, "centerAlign" 
					]
				],
				[
					"solved_layer.png",
					[
						"halfWidth +200", 320, 180, 180, null
					]
				],
				[
					"In the solved side, the entire face is yellow, but the parts along its edge don't match up. In the solved layer, the difference is that the colors along the edge do line up.\n\nThat may have been a bit confusing, but don't worry! This idea of solving in layers is built into this tutorial, so it will happen naturally. Also, here's some quick nomenclature that I'll be using to identify certain pieces:",
					[
						null, 430, null, null, null, null
					]
				],
				[
					"Center Pieces",
					[
						"halfWidth -300", 620, 30, "centerAlign" 
					]
				],
				[
					"center_pieces.png",
					[
						"halfWidth -300", 680, null, null, null
					]
				],
				[
					"Edge Pieces",
					[
						"halfWidth", 620, 30, "centerAlign" 
					]
				],
				[
					"edge_pieces.png",
					[
						"halfWidth", 680, null, null, null
					]
				],
				[
					"Corner Pieces",
					[
						"halfWidth +300", 620, 30, "centerAlign" 
					]
				],
				[
					"corner_pieces.png",
					[
						"halfWidth +300", 680, null, null, null
					]
				]
			],
			[
				"Lastly, you need to learn about turning notation. Each of the six sides has a letter representing it, and indicates a turn to that side. It should be turned clockwise from the perspective of that side. Note that while doing the following turns, the leftmost of the three sides shown should point towards you.",
				[
					"front_side.png",
					[
						"halfWidth -500", 270, null, null, null
					]
				],
				[
					"F",
					[
						"halfWidth -500", 355, 36, "centerAlign" 
					]
				],
				[
					"back_side.png",
					[
						"halfWidth -300", 270, null, null, null
					]
				],
				[
					"B",
					[
						"halfWidth -300", 355, 36, "centerAlign" 
					]
				],
				[
					"up_side.png",
					[
						"halfWidth -100", 270, null, null, null
					]
				],
				[
					"U",
					[
						"halfWidth -100", 355, 36, "centerAlign" 
					]
				],
				[
					"down_side.png",
					[
						"halfWidth +100", 270, null, null, null
					]
				],
				[
					"D",
					[
						"halfWidth +100", 355, 36, "centerAlign" 
					]
				],
				[
					"left_side.png",
					[
						"halfWidth +300", 270, null, null, null
					]
				],
				[
					"L",
					[
						"halfWidth +300", 355, 36, "centerAlign" 
					]
				],
				[
					"right_side.png",
					[
						"halfWidth +500", 270, null, null, null
					]
				],
				[
					"R",
					[
						"halfWidth +500", 355, 36, "centerAlign" 
					]
				],
				[
					"These letters represent the sides: Front, Back, Up, Down, Left, Right. These can be reversed by an apostrophe (known as a \"prime\" symbol) following it, which makes it turn counter-clockwise. The number 2 following it means to turn the side twice.\n\nFor example, B' means to turn the back side (second image) counter-clockwise. 2R means to turn the right side (last image) twice.\n\nAnd that's all you really need to know about for now. So buckle up and get your cube out, because this is going to be a fun, easy, and relaxing experience. Also, did I forget to mention that there are more than 43 quintillion possible configurations of the Rubik's Cube? OOPS...",
					[
						null, 390, null, null, null, null
					]
				]
			]
		],
	"The Cross":
		[
			[
				[
					"The first step to solving the Rubik's Cube is by making a white cross-shaped pattern.\n\nThe pattern, as shown in the photo, is made up of a white center piece, and four white edge pieces (edge pieces with the white and another color). But one very important thing to notice is that the other color on the white edge pieces line up with the center pieces on the other sides. ",
					[
						null, null, "width -400", null, null, null
					]
				],
				[
					"the_cross.png",
					[
						"width -200", 200, 200, 200, null
					]
				],
				[
					"To accomplish this, you will mostly have to use your intuition. Luckily, I can give you a bit of help to make this easier. Instead of putting the white edge pieces directly into position, you can line them up around the yellow center piece, opposite of the white one. This pattern is known as the \"daisy\", shown on the left.\n\nAs you can see, the white edge pieces don't have to be lined up with the adjacent center pieces. This pattern is a bit easier to make without that restriction.",
					[
						300, 316, "width -400", null, null, null
					]
				],
				[
					"the_daisy.png",
					[
						180, 410, 200, 200, null
					]
				],
				[
					"Once you get the white edge pieces lined up, all you have to do is rotate them into place. To do this, turn the daisy around until one of its white edge pieces' colored part lines up with the color of the adjacent center piece. Then, turn that side twice! Repeat this for all other three edge pieces.\n\nIf you've done everything right, you should have completed The Cross!",
					[
						null, 540, null, null, null, null
					]
				]
			]
		],
	"The First Layer":
		[
			[
				"The next step is filling out a layer. To do this, we just need to insert white corner pieces between parts of The Cross. First, make sure you're holding the cube so that The Cross is pointing down. This might be a bit confusing at first, but it will make things easier.",
				[
					"Then, find a white corner piece. It should have white and two other colors on it. The end goal is shown on the right; notice how it's lined up with the colors around it. If the corner piece you chose is next to the yellow center piece, you can skim through this next part. If it's stuck next to the white center piece, follow along with the next steps.",
					[
						null, 230, "width -350", null, null, null
					]
				],
				[
					"white_corner_end.png",
					[
						"width -160", 290, 140, 140, null
					]
				],
				[
					"first_layer_corner_up.png",
					[
						160, 445, 140, 140, null
					]
				],
				[
					"The corner piece should be in in the position as shown on the left. Make sure you hold your cube as shown on the right, so that the corner piece is on the bottom right, and execute the following algorigthm: [R U R' U']. This algorithm will orient the corner piece next to the yellow center piece. Get used to doing this algorithm, as it comes up a lot.",
					[
						250, 375, "width -500", null, null, null
					]
				],
				[
					"first_layer_corner_down.png",
					[
						"width -160", 445, 140, 140, null
					]
				],
				[
					"corner_piece_out.png",
					[
						160, 620, 140, 140, null
					]
				],
				[
					"The corner piece should now be next to the yellow center piece as shown. Lastly, we just need to get the piece into its final position. Start by rotating the top (yellow) side until the two non-white colors on the corner piece match up with the two colors of the center pieces below it, as shown in the photo to the left. As you can see in this example, the orange and blue of the corner piece matches with the orange and blue center pieces below.",
					[
						250, 550, "width -350", null, null, null
					]
				]
			],
			[
				"All that's left to do now for the corner piece is to get it into the correct orientation! Repeat the algorithm: [R U R' U'] until the white part of the corner piece matches with the white pieces around it. Notice that this algorithm is the same one we used to take the corner piece out.\n\nNow that we have inserted one corner piece, we just need to repeat this process for the three other white corner pieces! Here's an example of what the cube might look like after each step:",
				[
					"first_layer_corner_up.png",
					[
						"halfWidth -350", 400, 160, 160, null
					]
				],
				[
					"first_layer_1.png",
					[
						"halfWidth", 400, 160, 160, null
					]
				],
				[
					"first_layer_2.png",
					[
						"halfWidth +350", 400, 160, 160, null
					]
				],
				[
					"first_layer_3.png",
					[
						"halfWidth -180", 560, 160, 160, null
					]
				],
				[
					"first_layer_4.png",
					[
						"halfWidth +180", 560, 160, 160, null
					]
				],
				[
					"Hopefully, your cube looks like the last image. If it does, you've solved The First Layer!",
					[
						null, 660, null, null, null, null
					]
				]
			]
		],
	"The Second Layer":
		[
			[
				"Now that the first layer is solved, we need to fill in the second layer. Start by finding an edge piece with two colors that aren't yellow. Ensure that it's adjacent to the yellow side; it should not be stuck in the second layer. If there are no edge pieces like this, skim through to the note at the end to get the piece mentioned, then come back to properly insert it into the second layer.",
				[
					"edge_piece_lineup.png",
					[
						150, 300, null, null, null
					]
				],
				[
					"Rotate the top (yellow) side until the color of the piece (in this case, the red-green edge piece) lines up with the color of the center piece below as shown. From here, there are two algorithms you need to know to insert the piece into the second layer.",
					[
						220, 260, "width -320", null, null, null
					]
				],
				[
					"To choose the correct algorithm, take note of the position of the edge piece in relation to the spot where it will be inserted. This spot is in between two center pieces, whose colors correspond to the colors of the edge piece. As seen in the previous image, the edge piece is on the left of its insertion location. It can also be to the right, as shown in the image to the right.",
					[
						null, 370, "width -310", null, null, null
					]
				],
				[
					"edge_piece_lineup_alt.png",
					[
						"width -150", 430, null, null, null
					]
				],
				[
					"Hold the cube with the edge piece facing you. If the edge piece is to the left of the insertion spot, use the following algorithm: [U R U' R' U' F' U F]. If it's on the right, use this algorithm: [U' L' U L U F U' F']. After you've inserted an edge, just repeat this process for the other 3 edge pieces to solve The Second Layer!",
					[
						null, 510, null, null, null, null
					]
				],
				[
					"Note: if an edge piece is stuck in the second layer in the wrong orientation, you need to remove it to insert it properly. Hold the cube with the piece you want to remove on the right, then execute the algorithm: [U R U' R' U' F' U F] (same algorithm as the first one in the previous paragraph). This will remove the piece and allow you to reinsert it properly. This process may need to be repeated for a few edge pieces.", 
					[
						null, 630, null, null, 16, null
					]
				]
			]
		],
	"The Cross 2.0":
		[
			[
				"The rest of the solve is mostly just following along with algorithms. At this point, there are 4 ways the yellow edge pieces on your cube could look like:",
				[
					"No Yellow Edges",
					[
						"halfWidth -420", 335, 18, "centerAlign" 
					]
				],
				[
					"no_yellow_edges.png",
					[
						"halfWidth -420", 250, 120, 120, null
					]
				],
				[
					"L Shape",
					[
						"halfWidth -140", 335, 18, "centerAlign" 
					]
				],
				[
					"L_yellow_edges.png",
					[
						"halfWidth -140", 250, 120, 120, null
					]
				],
				[
					"Line Shape",
					[
						"halfWidth +140", 335, 18, "centerAlign" 
					]
				],
				[
					"line_yellow_edges.png",
					[
						"halfWidth +140", 250, 120, 120, null
					]
				],
				[
					"Cross Shape",
					[
						"halfWidth +420", 335, 18, "centerAlign" 
					]
				],
				[
					"cross_yellow_edges.png",
					[
						"halfWidth +420", 250, 120, 120, null
					]
				],
				[
					"Notice that this only looks at the yellows of edge pieces, so you can disregard the yellow corner pieces at this point. Some yellow corner pieces may be oriented in a way that makes it hard to tell which one you have, so make sure you correctly determine your case. Then, follow along with the corresponding case.", 
					[
						null, 370, null, null, null, null
					]
				],
				[
					"Let's start with the first case. From here, use this algorithm from any orientation to make it look like the L shape: [F R U R' U' F']. To help you remember this algorithm, notice that it contains an algorithm we used previously: [R U R' U']. The only difference is that it starts with [F] and ends with [F'].\n\nAnyway, we need to use this algorithm 2 more times from different orientations to solve the yellow cross.", 
					[
						300, 485, "width -400", null, null, null
					]
				],
				[
					"no_yellow_edges.png",
					[
						180, 580, 200, 200, null
					]
				]
			],
			[
				[
					"For the second case, your yellow edges should be in the \"L\" shape as shown to the right. Hold the cube with one yellow edge on the left and the other on the back, and execute the same algorithm mentioned previously: [F R U R' U' F']. This will give you the line shape.\n\nHere's the third case. Hold the cube with one yellow edge on the left and the other on the right. For the last time (or first, if your cube already looked like this), execute the algorithm: [F R U R' U' F']. Now your cube should have a yellow cross on the top!", 
					[
						null, null, "width -300", null, null, null
					]
				],
				[
					"L_yellow_edges.png",
					[
						"width -150", 160, null, null, null
					]
				],
				[
					"line_yellow_edges.png",
					[
						"width -150", 275, null, null, null
					]
				],
				[
					"cross_yellow_edges.png",
					[
						150, 380, null, null, null
					]
				],
				[
					"Here's the last case, where it looks like we've already solved the yellow cross. But like the white cross, we need to make sure the colors on the edge pieces match up with the colors of the center pieces.", 
					[
						220, 340, "width -320", null, null, null
					]
				],
				[
					"Rotate the top layer until two of the edge piece colors line up with the center pieces in the second layer. These colors will either line up next to each other or across from each other.\n\nIf the edge pieces line up across from each other, execute this algorithm from anywhere: [R U R' U R U2 R']. Then, rotate the top layer until two edge piece colors line up with the center pieces. This time, the edge pieces will be lined up next to each other.\n\nNow, hold the cube with a matched edge piece on the right and on the other on the back, and use the same algorithm: [R U R' U R U2 R']. Rotate the top layer until it lines up, and you've solved The Cross 2.0!",
					[
						null, 450, null, null, null, null
					]
				]
			]
		],
	"The Corners":
		[
			[
				"The second to last step is getting all the yellow corner pieces in the right spot. Just like how we aligned the yellow edges, we're going to repeat an algorithm from different orientations to accomplish this.",
				[
					"Find a yellow corner piece that matches the colors of the center pieces around it. For example, a blue-orange-yellow corner piece surrounded by the blue, orange, and yellow center pieces. Do not rotate the yellow side to match up any corner piece, and ensure that the yellow edges that we solved stay in place.\n\nIf there are no corner pieces like this, use the next algorithm from anywhere to get one.",
					[
						null, 210, "width -400", null, null, null
					]
				],
				[
					"yellow_corner_aligned.png",
					[
						"width -200", 280, 200, 200, null
					]
				],
				[
					"Hold the corner piece on the front left, and execute the following algorithm: [R U' L' U  R' U' L U]. Then, check all of the corner pieces. If they all match up with the center pieces around them like the first corner piece you found, you're done with this step! Otherwise, you just need to use the algorithm one more time from the same place, and the corner pieces should all line up.\n\nAnd look at that! You've finished The Corners!",
					[
						null, 405, null, null, null, null
					]
				],
				[
					"This step was so quick and easy that I didn't have enough to fill up the whole page. This part only serves one purpose: to fill the blank space left in the screen. If you're reading this, you're wasting time! You should probably go to the next section. Okay. Goodbye.", 
					[
						null, 630, null, null, 16, null
					]
				]
			]
		],
	"The Solve":
		[
			[
				"Finally, we're just one step away from solving the Rubik's Cube! This step is probably the scariest one, because it's easy to get wrong, and doing so messes up the whole cube. If you follow along carefully, though, it'll be pretty easy and simple.",
				[
					"solve_hold_orientation.png",
					[
						150, 270, null, null, null
					]
				],
				[
					"Hold the cube with the white side up. Make sure that there is an unsolved yellow corner piece on the bottom right, as shown in the photo. You can rotate the entire cube to get a piece like this, but for the rest of the solve, make sure not to rotate the entire cube.",
					[
						220, 230, "width -320", null, null, null
					]
				],
				[
					"Next, repeat the famous algorithm: [R U R' U'] until the yellow corner piece orients itself correctly. Although the white side is messed up now, don't worry! Everything will solve itself if you follow along precisely. Your cube should look something like the photo on the right.",
					[
						null, 340, "width -300", null, null, null
					]
				],
				[
					"the_solve_first_corner.png",
					[
						"width -150", 380, null, null, null
					]
				],
				[
					"Now turn the bottom side with [D]. If the piece on the bottom right is in the wrong orientation, repeat [R U R' U'] until it gets into the correct orientation. Otherwise, keep doing [D] moves until it is an unsolved corner piece, and execute the method previously mentioned.",
					[
						220, 450, "width -320", null, null, null
					]
				],
				[
					"the_solve_second_corner.png",
					[
						150, 490, null, null, null
					]
				],
				[
					"Repeat this method until you've solved the cube! [D] move, [R U R' U'] until the corner is oriented correctly, repeat. Again, never rotate the entire cube.\n\nIf you've done this correctly, then congratulations! You've officialy solved the Rubik's Cube!",
					[
						null, 560, null, null, null, null
					]
				]
			]
		],
	"Conclusion":
		[
		],
	"defaultSettings":
		{
			"textDefault":
			[
				100, 120, "width -200", "height -100", 22, "leftAlign"
			],
			"imageDefault":
			[
				0, 0, 100, 100, "centerAlign"
			]
		}
}