{
	"Introduction":
		[
			[
				"The Rubik's Cube is very misunderstood. Most people say things like, \"I just peel the stickers off,\" \"I can solve 5 sides,\" and \"Wow, you must be really smart if you can solve the Rubix (incorrect spelling) Cube!\" These Rubik's Cube) say to sound smart.\n\nYou're probably wondering why this matters. It doesn't. Just don't go around doing these things if you don't know what you're talking about.\n\nAnyway, what is the Rubik's Cube? It's a simple puzzle and configured in many different ways. When it is put into a \"scrambled\" state, it can be extremely difficult, nearly impossible, to solve without any guidance. Luckily, many methods have been created to make this process easier, and now pretty much anyone can solve it, including you!\n\nI'll be going over a method for beginners that is easy to understand, so if you're scared or think you're not capable or \"not smart enough\", don't worry! I even taught my dog how to do it*!\n\nIf you're excited to solve your first Rubik's Cube, that's great! But before we get into how to solve it, you'll have to know a few important things.",
				[
					"*I don't have a dog, nor did I teach him how to solve the Rubik's Cube", 
					[
						100, 120, "drawingWidth -200", "drawingHeight -100", 15, "leftAlign"
					]
				]
			],
			[
				"First, the Rubik's Cube is solved in layers, not sides. Surprisingly, trying to solve the cube by getting one side at a time makes it much more difficult. This is what a solved side versus a solved layer looks like:",
				"In the solved side, the entire face is yellow, but the parts along its edge don't match up. In the solved layer, the difference is that the colors along the edge do line up.\n\nThat may have been a bit confusing, but don't worry! This idea of solving in layers is built into this tutorial, so it will happen naturally. Also, here's some quick nomenclature that I'll be using to identify certain pieces:"
			],
			[
				"Lastly, you need to learn about turning notation. Each of the six sides has a letter representing it, and indicates a turn to that side. It should be turned clockwise from the perspective of that side. Note that while doing the following turns, the leftmost of the three sides shown should point towards you.",
				"These letters represent the sides: Front, Back, Up, Down, Left, Right. These can be reversed by an apostrophe (known as a \"prime\" symbol) following it, which makes it turn counter-clockwise. The number 2 following it means to turn the side twice.\n\nFor example, B' means to turn the back side (second image) counter-clockwise. 2R means to turn the right side (last image) twice.\n\nAnd that's all you really need to know about for now. So buckle up and get your cube out, because this is going to be a fun, easy, and relaxing experience. Also, did I forget to mention that there are more than 43 quintillion possible configurations of the Rubik's Cube? OOPS..."
			]
		],
	"The Cross":
		[
			[
				"The first step to solving the Rubik's Cube is by making a white cross-shaped pattern.\n\nThe pattern, as shown in the photo, is made up of a white center piece, and four white edge pieces (edge pieces with the white and another color). But one very important thing to notice is that the other color on the white edge pieces line up with the center pieces on the other sides. ",
				"To accomplish this, you will mostly have to use your intuition. Luckily, I can give you a bit of help to make this easier. Instead of putting the white edge pieces directly into position, you can line them up around the yellow center piece, opposite of the white one. This pattern is known as the \"daisy\", shown on the left.\n\nAs you can see, the white edge pieces don't have to be lined up with the adjacent center pieces. This pattern is a bit easier to make without that restriction.",
				"Once you get the white edge pieces lined up, all you have to do is rotate them into place. To do this, turn the daisy around until one of its white edge pieces' colored part lines up with the color of the adjacent center piece. Then, turn that side twice! Repeat this for all other three edge pieces.\n\nIf you've done everything right, you should have completed The Cross!"
			]
		],
	"The First Layer":
		[
			[
				"The next step is filling out a layer. To do this, we just need to insert white corner pieces between parts of The Cross. First, make sure you're holding the cube so that The Cross is pointing down. This might be a bit confusing at first, but it will make things easier.",
				"Then, find a white corner piece. It should have white and two other colors on it, like the one shown in the photo (it doesn't have to be blue and orange). If the piece you found is already lined up next to the yellow center piece, you don't need to worry about this next part. Otherwise, make sure to follow along.",
				"The corner piece should be in in the position as shown on the left. Make sure you hold your cube as shown on the right, so that the corner piece is on the bottom right, and execute the following algorigthm: [R U R' U']. This algorithm orients the corner piece next to the yellow center piece. Get used to doing this algorithm, as it comes up a lot."
			]
		],
	"The Second Layer":
		[
		],
	"The Cross 2.0":
		[
		],
	"The Corner Fix":
		[
		],
	"The Solve":
		[
		],
	"Conclusion":
		[
		],
	"defaultSettings":
		[
			100, 120, "drawingWidth -200", "drawingHeight -100", 22, "leftAlign"
		]
}